{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_4": {"name": "input_layer_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "126"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "43"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/flatten_4_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_13_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_13_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_14_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_14_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_15_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "43"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "43"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "126"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Shape", "op": "Shape", "input": ["input_layer_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/Shape", "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack", "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice", "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/1", "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape", "op": "Reshape", "input": ["input_layer_4", "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/MatMul", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/MatMul", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/MatMul", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape_1", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape_1", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape_1", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Add", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Add"], "attr": {"N": {"i": "2"}, "equation": {"s": "QlROSCxCU05ILT5CTlRT"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/einsum/Einsum", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Softmax", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Add"], "attr": {"equation": {"s": "Qk5UUyxCU05ILT5CVE5I"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/einsum_1/Einsum", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape_1"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/MatMul", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/add_4_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape", "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_4_1/add_4_1/Add", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_4_1/add_4_1/Add", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/variance", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Rsqrt", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Neg", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/add_4_1/Add", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_2", "op": "AddN", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul_2", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/ArithmeticOptimizer/AddOpsRewrite_add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape_1", "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_2"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/flatten_4_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/ArithmeticOptimizer/AddOpsRewrite_add_2", "StatefulPartitionedCall/functional_4_1/flatten_4_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_13_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/flatten_4_1/Reshape", "StatefulPartitionedCall/functional_4_1/dense_13_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/dense_13_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/dense_13_1/Relu", "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_14_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/add_1", "StatefulPartitionedCall/functional_4_1/dense_14_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/dense_14_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/dense_14_1/Relu", "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_15_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/add_1", "StatefulPartitionedCall/functional_4_1/dense_15_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/dense_15_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/dense_15_1/Relu", "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/add_1", "StatefulPartitionedCall/functional_4_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/dense_16_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_4_1/dense_16_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_4_1/dense_16_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape_1", "shape": [1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape", "shape": [3, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Reshape_1/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/query_1/Add/ReadVariableOp", "shape": [4, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape", "shape": [3, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Reshape_1/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/key_1/Add/ReadVariableOp", "shape": [4, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/reshape_4_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape", "shape": [3, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Reshape_1/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/value_1/Add/ReadVariableOp", "shape": [4, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/Reshape_1", "shape": [12, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/multi_head_attention_4_1/attention_output_1/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/layer_normalization_4_1/Reshape", "shape": [1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/flatten_4_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_13_1/Cast/ReadVariableOp", "shape": [126, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_13_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_9_1/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_14_1/Cast/ReadVariableOp", "shape": [512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_14_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_10_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_15_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_15_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/batch_normalization_11_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/Cast/ReadVariableOp", "shape": [128, 43], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/dense_16_1/BiasAdd/ReadVariableOp", "shape": [43], "dtype": "float32"}]}]}